#include <iostream>
//
// Основной класс - Game
// Отвечает за основной цикл
// Должен управлять сложностью игры
// и в целом быть оболочкой для игровой логики программы
// 
// Игровое поле - Scene
// Должна знать где распологаются игровые объекты и что они такое
// Класс игрового объекта - Базовый класс для всего, что есть на сцене
// 
// Класс Координат нужно как то запоминать позицию
// 
// Игроки, спрайты, снаряды и прочее будет наследниками игрового объекта
//


int main() {
	//e4 e5 kf3 kc6 d4 e:d c3 d:c kc3 cb4 cc4 ke7 kg5 0-0 qh5 h6 kf7 qe8  

	return 0;
}